In [13]:
# For PostGREs and SQLAlchemy
!pip install psycopg2 sqlalchemy

Requirement already satisfied: psycopg2 in c:\users\17144\anaconda3\envs\pythondata\lib\site-packages (2.8.4)
Requirement already satisfied: sqlalchemy in c:\users\17144\anaconda3\envs\pythondata\lib\site-packages (1.3.13)

In [3]:
import pandas as pd
from sqlalchemy import create_engine
import matplotlib.pyplot as plt
import numpy as np

In [7]:
engine = create_engine('postgres://postgres:Hope%401714@localhost:5432/Employee_db')
conn = engine.connect()

In [8]:
department = pd.read_sql("SELECT * FROM dept_employee", conn)
data.head()

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01

In [9]:
salary = pd.read_sql("SELECT * FROM salaries", conn)
salary.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10002   65828  1996-08-03  1997-08-03
2   10003   40006  1995-12-03  1996-12-02
3   10004   40054  1986-12-01  1987-12-01
4   10005   78228  1989-09-12  1990-09-12